app/controllers/api/songs_controller.rb

    def index
        @songs = Song.all
---
SELECT "songs"."id" FROM "songs"

    def create
        @song = Song.new(song_params)
        if @song.save
---
INSERT INTO "songs" ("title", "description", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "coda"], ["description", "the first coda track"], ["artist_id", 11], ["created_at", "2020-03-04 17:41:28.191239"], ["updated_at", "2020-03-04 17:41:28.191239"]]

    def update
        @song = Song.find(params[:id])
        if @song.update(song_params)
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "songs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "songs"."id" = $4  [["title", "updateCoda"], ["description", "the first UPDATED coda"], ["updated_at", "2020-03-04 18:15:27.869268"], ["id", 5]]

    def destroy
        @song = Song.find(params[:id]) # current user later
        if @song && @song.delete
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 6]]