CodaApp/coda/app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom.urlsafe_base64
        self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "CwXjpmusxAqxRHqEYct69Q"], ["updated_at", "2020-02-29 22:08:38.119110"], ["id", 3]]